let N = +prompt(`Дай мені перше число, від якого почнемо складання`);

while (N === `` || N === null || isNaN(N) || N === 0 || N % 1 !== 0) {
  
  if (N % 1 !== 0) {
  N = +prompt(`Ваше число не є цілим, потрібно обрати ціле`);

  } else {
  N = +prompt(`Ти маєш надати число`)};
}



alert(`Ваше перше число: ${N}`);
document.writeln(`Ваше перше число:`, N);

let M = +prompt(`Дай мені друге число, до якого будемо складувати`);

while (M === `` || M === null || isNaN(M) || M === 0 || M % 1 !== 0) {
  
  if (M % 1 !== 0) {
  M = +prompt(`Ваше число не є цілим, потрібно обрати ціле`);

  } else {
  M = +prompt(`Ти маєш надати число`);}

}


while (M < N) {
  M = +prompt(`Друге число, має бути більше за перше`);
}






alert(`Ваше друге число: ${M}`);
document.writeln(`Ваше друге число:`, M);

const pair = confirm(`Чи пропускати при обчисленні ПАРНІ числа?`);

pair ? alert(`Ми пропускаємо парні числа`) : alert(`Ми не пропускаємо парні числа`);

let sum = 0;

if (pair) {
    for (let i=N; i<=M; i++) {   
      if (i % 2 !== 0) {
      sum = sum + i
      }    
    }  
} else {for (let i=N; i<=M; i++) {         
  sum = sum + i;
  }
}  


document.writeln(`Ваша сума:${sum}, почті без підказок`);
alert(`Сумма ${sum}, почті без підказок`);